tests/mocks/get_payment_success.json

{
  "id": "CHAR_D32A01A9-92A6-4755-B21D-7B6A1291F7AD",
  "reference_id": "ex-00001",
  "status": "PAID",
  "created_at": "2019-04-17T20:07:07.002-02",
  "paid_at": "2019-04-17T20:07:07.002-02",
  "description": "Motivo do pagamento",
  "amount": {
    "value": 1000,
    "currency": "BRL",
    "summary": {
      "total": 1000,
      "paid": 1000,
      "refunded": 0
    }
  },
  "payment_response": {
    "code": "20000",
    "message": "SUCESSO",
    "reference": "070177181003"
  },
  "payment_method": {
    "type": "CREDIT_CARD",
    "installments": 1,
    "capture": false,
    "card": {
      "brand": "VISA",
      "first_digits": "411111",
      "last_digits": "1111",
      "expiry_month": "03",
      "expiry_year": "2026",
      "holder": {
        "name": "Jose da Silva"
      }
    }
  },
  "notification_urls": [
    "https://yourserver.com/nas_ecommerce/277be731-3b7c-4dac-8c4e-4c3f4a1fdc46/"
  ],
  "metadata": {
    "Exemplo": "Aceita qualquer informação",
    "NotaFiscal": "123",
    "idComprador": "123456"
  },
  "links": [
    {
      "rel": "SELF",
      "href": "https://sandbox.api.pagseguro.com/charges/CHAR_D32A01A9-92A6-4755-B21D-7B6A1291F7AD",
      "media": "application/json",
      "type": "GET"
    },
    {
      "rel": "CHARGE.CANCEL",
      "href": "https://sandbox.api.pagseguro.com/charges/CHAR_D32A01A9-92A6-4755-B21D-7B6A1291F7AD/cancel",
      "media": "application/json",
      "type": "POST"
    }
  ]
}
